using System;
using System.IO;
using System.Text;
using SharpCompress;
using SharpCompress.Archives;
using SharpCompress.Common;
using SharpCompress.Writers;
using SharpCompress.Compressors;

namespace TudouSharp
{
    class Program
    {
        static void Main(string[] args)
        {
            //             string Text = @"　　北京时间1月19日，NBA2018年全明星票选结果出炉，骑士当家勒布朗-詹姆斯力压勇士球星斯蒂芬-库里，生涯第五次当选全明星票王，而他这一成就已经排在了历史第二位，仅次于迈克尔-乔丹。

            // 　　此前，詹姆斯曾经在2007年，2010年，2014年和2017年四次当选全明星票王，跟文斯-卡特和朱利叶斯-欧文两代扣神并列历史第二位，如今第五次当选，詹皇可以独享历史第二的头衔。";

            string foText = @"令如戒空名施普廟求鄉弟訶刚妙毒諦和皂闍经盡于輸祖倒恐阿愛须盧经虚开先智呼千及夫輸勒定宇虚药姪蘇忧勒重药宝利于药文持定禮憐依恤弥藐精諦万利竟曰粟陵度行须想創琉休寂首昼方吼夫恐开朋弥曰度毒诸令安进幽親廣琉栗槃禮難五精游精愛梭说先重幽竟数捐首創界七栗吼夢瑟夢知琉教創薩栗敬求殿倒曳殺訶故羅師排梭印精护昼呼參心牟灯万安諦普舍忧虚廣朋说知醯兄積昼造彌持凉祖資者游經及毘花麼栗皂如陰度弥毒故释羅寂告藥毒功智及闍寡树特多故盧恐未醯殿難去至七高藥瑟量伊花说耨以矜妙守貧央貧路寂清楞释至貧即薩及貧即戒槃濟东訶提树月消蒙诸哈急謹利訶參刚陀死蘇創行師輸陵故經各璃排惜恐行難諦伊宝来万藝睦勒礙山金劫難濟路及濟精寡来说璃姪乾夜劫羅矜殊牟清想族诸如者六宝文以量北凉陵先福以難贤兄下告足根开进六伊先通豆拔先殺曰行能三号夢告資师德殊友空未迦槃殺宝彌逝濟難難室诸七依首便月排師定困西依即逝毒寂兄遮鄉師禮定槃恐吼释生各姪捨各妙資西灭王过麼量宇凉息造住迦告持求解度恤勒鄉西亿各诸拔拔創憐须此劫敬数即沙劫朋遠慈亿数印过尊難凉廣虚廣戏北閦慈稳者參刚皂除濟六千弟根藐紛空遮紛殿放贤诸難定至槃夜鄉惜牟夷睦高息提皂未室利行药數老創稳資德藥北茶劫貧如空度尊央利数陰未度栗顛訶毒东教贤根曳孫難焰中參便急求急夜精呼此死祖真濟愛藥便困福伊兄清求乾濟謹量盡乾恐孤兄空者孝茶慈盧路路善幽令害故濟耨祖百胜難百盧如捨弟毒訶倒妙七勒须夫定住提央茶路来多施说过来創灯兄王呼进婦六胜休亦诵如信北多孕未路依礙功能逝惜胜刚夷特下紛如即兄告忧夷过慈廟師数實印羅花百千麼盡故廟昼恐来量至醯在东陀牟花經消楞利梭資恐孫文遮此住宇智精陵告故毘經宇即薩想灭殺生孫尼休彌故廟醯殿楞清栗盧告息姪号橋利闍藥親親吼楞昼羅须真盧月造迦夢精紛能慈中百師死槃哈诵福树積廟弥曳逝须遠愛勒害未舍蘇尊經须多下如戒璃除恤足定琉月此陀鄉空彌訶在宝參休千未刚顛乾廣楞路牟諦殿妙族界闍陰故五七提楞顛通月殊孝槃释乾空梭护廣資夢贤孤惜孝麼尊勒時善宗逝倒五閦普梭花名依妙親先祖禮去慈困";

            Console.WriteLine(Tudou2.Decode(foText));


        }
    }
}
